## How to import time series data from Refinitiv Eikon API

1. Import libraries

In [18]:
import eikon as ek
import pandas as pd

2. Start up the Refinitiv Eikon Desktop application, then set the app key below

In [3]:
ek.set_app_key('b6996de4c3da42159e313332560417e1f67288ca')

3. Set our symbols

In [4]:
symbols = ['AAPL.O']

4. Get our data

In [16]:
data = ek.get_timeseries(symbols,
                         start_date = '2021-01-01',
                         end_date = '2022-03-24',
                         interval='minute',
                         fields=['*'])

In [24]:
dataset = data
dataset.describe()

AAPL.O,HIGH,LOW,OPEN,CLOSE,COUNT,VOLUME
count,50000.000000,50000.000000,50000.000000,50000.000000,50000.000000,5.000000e+04
mean,166.628884,166.432149,166.534288,166.533962,847.654700,9.930146e+04
std,6.314160,6.354434,6.329535,6.329614,1373.100586,3.485259e+05
min,149.000000,126.200000,148.940000,149.000000,1.000000,1.000000e+00
25%,162.030000,161.817425,161.940000,161.935675,25.000000,8.130000e+02
50%,166.700000,166.490000,166.600000,166.600000,107.000000,7.271000e+03
75%,172.250000,172.110000,172.190000,172.190000,1375.000000,1.416705e+05
max,181.856023,176.980000,177.079100,177.071100,41898.000000,2.421336e+07

In [25]:
dataset.head()

AAPL.O                 HIGH     LOW     OPEN    CLOSE  COUNT  VOLUME
Date
2022-01-06 22:35:00  172.35  172.26  172.270  172.305     26    1878
2022-01-06 22:36:00  172.42  172.30  172.305  172.350     53    3265
2022-01-06 22:37:00  172.42  172.35  172.355  172.380     20     221
2022-01-06 22:38:00  172.39  172.28  172.390  172.390     37     674
2022-01-06 22:39:00  172.39  172.35  172.390  172.350     19     119

In [26]:
dataset.tail()

AAPL.O                 HIGH     LOW      OPEN   CLOSE  COUNT  VOLUME
Date
2022-03-23 23:56:00  170.53  170.49  170.5300  170.50     25    4592
2022-03-23 23:57:00  170.50  170.47  170.5000  170.50     23    6848
2022-03-23 23:58:00  170.64  170.49  170.5200  170.63     45    4585
2022-03-23 23:59:00  170.64  170.56  170.6399  170.60     23    2362
2022-03-24 00:00:00  170.69  170.63  170.6300  170.69     71    5443

It would appear that the minute data is severly limited. To make up for this, we're going to have to scrape a bunch of symbols and compile all their data. The next task therefor is to compile a list of all these tickers and then create our targets.